#include<stdio.h>
#include <windows.h>//window 헤더 파일
#define ONE_SECOND 1000
int field[20][30]= {
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}        
};
//인공 유기체가 살아갈 환경(생태계)
void fg(){
        int i,j;
        for (i=0; i<=19; i++) {
                for (j=0; j<=29; j++) {
                        printf("%d", field[i][j]);
                }
                printf("\n");
        }
        printf("\n\n\n\n");
        i=0;
        j=0;
        
        //        생태계를 출력하는 함수
}
main()
{
        
        int i,j;
        for (i=0; i<=19; i++) {
                for (j=0; j<=29; j++) {
                        printf("%d", field[i][j]);
                }
                printf("\n");
        }
        i=0;
        j=0;
        
        
        int b, c;
        scanf("%d %d", &b, &c);
                field[c][b] = 5;
        //인공 유기체를 '5' 로 표현
                        
                        
        for (i=0; i<=19; i++) {
                for (j=0; j<=29; j++) {
                        printf("%d", field[i][j]);
                }
                printf("\n");
        }
        printf("\n\n\n\n");
        i=0;
        j=0;                

        int e, f;
        
        scanf("%d %d", &e, &f);
                field[f][e]= 3;
        //인공 유기물을 '3' 으로 표현

while(1){

        if (c < f){
                        if (b < e){
                                field[c][b]= 1;
                                field[c+1][b+1]=5;
                                c=c+1;
                                b=b+1;
                        } else
                        if (b == e){
                                field[c][b]= 1;
                                field[c+1][b]=5;
                                c=c+1;
                                b=b        ;
                        } else
                        if (b > e){
                                field[c][b]= 1;
                                field[c+1][b-1]=5;
                                c=c+1;
                                b=b-1;
                        }
                } else 
                if (c == f){
                        if (b < e){
                                field[c][b]= 1;
                                field[c][b+1]=5;
                                c=c;
                                b=b+1;
                        } else
                        if (b == e){
                                field[c][b]= 1;
                                field[c][b]=8;
                                c=c;
                                b=b;
                                fg();
                                break;// 먹이에 도달하게 되면 스스로를 8로 바꿈(먹이를 먹음으로써 반응함), 스크립트 종료
                        } else
                        if (b > e){
                                field[c][b]= 1;
                                field[c][b-1]=5;
                                c=c;
                                b=b-1;
                        }
                } else 
                if (c > f){
                        if (b < e){
                                field[c][b]= 1;
                                field[c-1][b+1]=5;
                                c=c-1;
                                b=b+1;
                        } else
                        if (b == e){
                                field[c][b]= 1;
                                field[c-1][b]=5;
                                c=c-1;
                                b=b        ;
                        } else
                        if (b > e){
                                field[c][b]= 1;
                                field[c-1][b-1]=5;
                                c=c-1;
                                b=b-1;
                        }
        }
fg();

Sleep(ONE_SECOND);// 먹이를 찾으러 가는 과정을 시간차를 두고 표현

}


}

이 프로그램은 아주 기본적인 유기체의 생명활동을 표현한 프로그램입니다. 30x20 크기의 1로 구성된 생태계를 만든 후, 원하는 위치에 a b 형태로 위치를 입력하면 ( 우리가 (1,1)로 보는 부분이 (0,0) 이기 때문에 a, b 위치를 선택하고자 한다면 실제로는 a-1, b-1을 입력해야 합니다.) 처음에는 5 모양의 인공 유기체가, 다음으로는 3 형태의 인공 유기물이 인공 생태계에 생성됩니다. 그 후 생명체는 먹이가 있는 위치까지 이동한 후, 형태를 8로 바꿔 섭취 활동을 하였음을 나타낸 후 프로그램이 멈춥니다. 
박테리아와 같은 기본적인 생물체의 먹이 섭취를 프로그래밍한 것입니다. 물론 dev c++을 활용한 간단한 프로그램이기 때문에 실제처럼 정교하지는 않지만, 이 프로그램의 목적을 유지하며 발전시켜 나간다면 실제 생태계를 모방하여 생물을 이용한 다양한 실험을 모의로 진행하여 실험의 정확도를 높이고 윤리적인 문제 또한 해결할 수 있을 것입니다. 
