#include<stdio.h>
main(){
#프로그래밍의 기본틀
float a,b,c;
#변수 선언
printf("탄소면 1을,수소면 2를,암모니아면 3을 입력하세요.");
#출력
scanf("%d",a);
if a=1{a=12}
if a=2{a=18}
if a=3{a=17}
#1,2,3은 화학식량을 불러오는 코드
printf("물질의 질량을 입력하세요.");
scanf("%f",b);
c=b/a
printf("입력하신 질량은 %f입니다.",c;};

저는 프로그래밍이 어려운것을 비교적 간단하게 해주는 능력을 가졌다고 생각합니다.
제가 2학년이 되고 화학1을 하면서 만난 제일 큰 산이 바로 몰이었는데요. 그래서 이번 질문을 읽고 바로 생각 난 것이 ”나와 같은 어려움을 겪는 학생들이 조금 더 쉽게 몰에 다가갈 수 있는 프로그램을 만들자!“였습니다. 간단하게 만들려고 애를 쓰느라 중간에 시행착오도 많았습니다. 그렇지만 고치면 고칠수록 나아지는 프로그램을 보면서 포기하지 않고 끈기를 가지면서 개발을 할 수 있었습니다. 지금 만든 프로그램은 내놓기엔 아직 많이 부족하지만 컴퓨터동아리를 들어가서 더욱 발전된 제가 되겠습니다!
